#pragma once
#include <vector>
#include <string>

//100 words
std::vector <std::string> words;

std::vector <std::string> suggestions = { 
"Гладко было на бумаге, да забыли про овраги, а по ним ходить.",
"Дело мастера боится, а иной мастер - дела.", 
"В здоровом теле - здоровый дух - редкая удача.", 
"Всяк правду любит, да не всяк ее творит.", 
"Родить дитя трудно, научить добру еще тяжелее.", 
"Наказывай детей в юности, успокоят тебя в старости.", 
"Люди ссорятся, а судьи кормятся.", 
"Без мирного неба не будет и хлеба.", 
"Шутку любишь над Фомой, так люби и над собой.", 
"Не было бы зла, да зависть нанесла.",
"Блажен, кто смолоду был молод, Блажен, кто вовремя созрел.",
"Но грустно думать, что напрасно Была нам молодость дана.",
"Я безмятежно расцветал, Читал охотно Апулея, А Цицерона не читал.",
"А я гордился меж друзей Подругой ветреной моей.",
"Но если б не страдали нравы, Я балы б до сих пор любил.",
"Ах, ножки, ножки! где вы ныне?",
"Нет, никогда порыв страстей Так не терзал души моей!.",
"Слова и взор волшебниц сих Обманчивы... как ножки их.",
"Как грустно мне твое явленье.",
"Мечтой о дальной стороне, О чудной ночи, о луне...",
"И мысль свою Беликов также старался запрятать в футляр.",
"Людей, одиноких по натуре, которые, как рак-отшельник или улитка, стараются уйти в свою скорлупу, на этом свете немало.",
"Одним словом, у этого человека наблюдалось постоянное и непреодолимое стремление окружить себя оболочкой.",
"Создать себе, так сказать, футляр, который уединил бы его, защитил бы от внешних влияний.",
"Спальня у Беликова была маленькая, точно ящик, кровать была с пологом.",
"Ложась спать, он укрывался с головой;",
"Нигилист - это человек, который не склоняется ни перед какими авторитетами.",
"Аркадий оглянулся и увидал женщину высокого роста, в черном платье, остановившуюся в дверях залы.",
"Порядочный химик в двадцать раз полезнее всякого поэта.",
"Время (дело известное) летит иногда птицей, иногда ползет червяком;",
"Всякий человек сам себя воспитать должен.",
"Идёт Смерть по улице, несёт блины на блюдце кому вынется - тому и сбудется.",
"Зубастые колёса завертелись в башке в промокшей башке под бронебойным дождём.",
"Буду пух глотать, буду в землю нырять И на все вопросы отвечать :'ВСЕГДА ЖИВОЙ!'.",
"Будь как дома, путник я ни в чём не откажу.",
"Множество историй коль желаешь - расскажу.",
"Лесник сидел напротив болтал о том, о сём.",
"Вот нож, вот возьми его коль хочешь жить - убей друга своего!",
"Два друга шли домой дорогой ночной.",
"Стала за ноги его кусать голова и он упал опять!",
"И руками голову свою держа радостно смеясь, он убежал.",
"Во мрак погружён туманный Альбион.",
"А когда посёлок спит, скрипка с кладбища звучит.",
"Но все думают он Скрипкой так увлечён.",
"Эту коду высек кто-то на его надгробной плите и маэстро год от года вновь играл мелодии те.",
"Мы родились в тесных квартирах новых районов.",
"Дальше действовать будем мы.",
"Мы хотим видеть дальше, чем окна дома напротив мы хотим жить, мы живучи, как кошки.",
"Нам уже стали тесны одежды, сшитые вами для нас одежды.",
"И вот мы пришли сказать вам о том, что дальше...",
"Если есть стадо, есть пастух, если есть тело, должен быть дух.",
"Если есть шаг, должен быть след, если есть тьма, должен быть свет.",
"Сесть на электрический стул или трон?",
"Снова за окнами белый день, день вызывает меня на бой.",
"Я чувствую, закрывая глаза, весь мир идёт на меня войной.",
"Каждой звезде свой неба кусок, каждому морю дождя глоток.",
"Каждому яблоку место упасть, каждому вору возможность украсть.",
"Каждой собаке палку и кость, и каждому волку зубы и злость.",
"Хочешь ли ты изменить этот мир?",
"Сможешь ли ты принять как есть?",
"На повестке дня колхозного партсобрания два вопроса: строительство сарая и строительство коммунизма, ввиду отсутствия досоксразу перешли ко второму вопросу.",
"- что такое вобла? - это кит, доплывший до коммунизма.",
"- никогда не думал, что ЦК подложит мне такую свинью! -сказал Ленин в марте 1953 года.",
"Мы все плывём по водам бурного потока, именуемого судьбой.",
"Но потом наше время истекает, и река жизни пересыхает, прежде чем мы успеваем понять, кто мы.",
"Мы, люди, хрупкие и смертные. Однако, даже когда нас ранят или мучают, в нас всё равно не угасает жажда жизни.",
"Даже если мечта лишь разрушает его жизнь, он не может позволить себе отказаться от неё.",
"В сердце каждого человека пылает огонь, который невозможно погасить.",
"В этом мире нет ничего более переменчивого, чем сердце человека.",
"Человек будет пристально смотреть на другого человека, если их чувства едины."
};

std::string w1000 = "год  человек  время  дело  жизнь  день  рука  раз  работа  слово  место  лицо  друг  глаз  вопрос  дом  сторона  страна  мир  случай  голова  ребенок  сила  конец  вид  система  часть  город  отношение  женщина  деньги  земля  машина  вода  отец  проблема  час  право  нога  решение  дверь  образ  история  власть  закон  война  бог  голос  тысяча  книга  возможность  результат  ночь  стол  имя  область  статья  число  компания  народ  жена  группа  развитие  процесс  суд  условие  средство  начало  свет  пора  путь  душа  уровень  форма  связь  минута  улица  вечер  качество  мысль  дорога  мать  действие  месяц  государство  язык  любовь  взгляд  мама  век  школа  цель  общество  деятельность  организация  президент  комната  порядок  момент  театр  письмо  утро  помощь  ситуация  роль  рубль  смысл  состояние  квартира  орган  внимание  тело  труд  сын  мера  смерть  рынок  программа  задача  предприятие  окно  разговор  правительство  семья  производство  информация  положение  центр  ответ  муж  автор  стена  интерес  федерация  правило  управление  мужчина  идея  партия  совет  счет  сердце  движение  вещь  материал  неделя  чувство  глава  наука  ряд  газета  причина  плечо  цена  план  речь  точка  основа  товарищ  культура  данные  мнение  документ  институт  ход  проект  встреча  директор  срок  палец  опыт  служба  судьба  девушка  очередь  лес  состав  член  количество  событие  объект  зал  создание  значение  период  шаг  брат  искусство  структура  номер  пример  исследование  гражданин  игра  начальник  рост  тема  принцип  метод  тип  фильм  край  гость  воздух  характер  борьба  использование  размер  образование  мальчик  кровь  район  небо  армия  класс  представитель  участие  девочка  политика  герой  картина  доллар  спина  территория  пол  поле  изменение  направление  рисунок  течение  церковь  банк  сцена  население  большинство  музыка  правда  свобода  память  команда  союз  врач  договор  дерево  факт  хозяин  природа  угол  телефон  позиция  двор  писатель  самолет  объем  род  солнце  вера  берег  спектакль  фирма  способ  завод  цвет  журнал  руководитель  специалист  оценка  регион  песня  процент  родитель  море  требование  основание  половина  роман  круг  анализ  стихи  автомобиль  экономика  литература  бумага  поэт  степень  господин  надежда  предмет  вариант  министр  граница  дух  модель  операция  пара  сон  название  ум  повод  старик  миллион  успех  счастье  ребята  кабинет  магазин  пространство  выход  удар  база  знание  текст  защита  руководство  площадь  сознание  возраст  участник  участок  пункт  линия  желание  папа  доктор  губа  дочь  среда  председатель  представление  солдат  художник  волос  оружие  соответствие  ветер  парень  зрение  генерал  огонь  понятие  строительство  ухо  грудь  нос  страх  услуга  содержание  радость  безопасность  продукт  комплекс  бизнес  сад  сотрудник  лето  курс  предложение  рот  технология  реформа  отсутствие  собака  камень  будущее  рассказ  контроль  река  продукция  сумма  техника  здание  сфера  необходимость  фонд  подготовка  лист  республика  хозяйство  воля  бюджет  снег  деревня  мужик  элемент  обстоятельство  немец  победа  источник  звезда  выбор  масса  итог  сестра  практика  проведение  карман  слава  кухня  определение  функция  войско  комиссия  применение  капитан  работник  обеспечение  офицер  фамилия  предел  выборы  ученый  бутылка  бой  теория  зона  отдел  зуб  разработка  личность  гора  товар  метр  праздник  влияние  читатель  удовольствие  актер  слеза  ответственность  учитель  акт  боль  множество  особенность  показатель  корабль  звук  впечатление  частность  детство  вывод  профессор  доля  норма  прошлое  командир  коридор  поддержка  рамка  враг  этап  черт  дед  собрание  прием  болезнь  клетка  кожа  заявление  попытка  сравнение  расчет  депутат  комитет  знак  дядя  учет  хлеб  чай  режим  целое  вирус  выражение  здоровье  зима  десяток  глубина  сеть  студент  секунда  скорость  поиск  суть  налог  ошибка  доход  режиссер  поверхность  ощущение  карта  клуб  станция  революция  колено  министерство  стекло  этаж  высота  бабушка  трубка  газ  мастер  поведение  столица  механизм  передача  способность  подход  энергия  существование  исполнение  кино  сожаление  заместитель  ресурс  акция  рождение  администрация  стоимость  улыбка  артист  сосед  фраза  фигура  субъект  реакция  список  фотография  журналист  май  нарушение  заседание  толпа  больница  существо  свойство  долг  поколение  животное  схема  усилие  отличие  остров  противник  волна  реализация  страница  формирование  житель  красота  птица  растение  тень  явление  храм  запах  водка  наличие  ужас  одежда  кресло  больной  поезд  университет  традиция  адрес  декабрь  ладонь  сведение  цветок  лидер  октябрь  занятие  сентябрь  помещение  январь  зритель  редакция  стиль  весна  фактор  август  известие  зависимость  охрана  оборудование  концерт  отделение  расход  выставка  милиция  переход  эпоха  запад  произведение  родина  собственность  тайна  трава  лагерь  имущество  кровать  аппарат  середина  март  клиент  дама  фронт  отрасль  стул  беседа  законодательство  продажа  повышение  музей  след  полковник  сомнение  понимание  апрель  князь  рыба  дума  кодекс  сутки  чудо  шея  судья  крыша  настроение  поток  должность  преступление  мозг  честь  пост  еврей  июнь  сотня  дождь  лестница  дача  установка  появление  получение  образец  труба  главное  осень  костюм  баба  ценность  обязанность  пьеса  таблица  вино  воспоминание  лошадь  коллега  организм  ученик  учреждение  открытие  том  черта  характеристика  выполнение  оборона  выступление  температура  перспектива  подруга  приказ  жертва  ресторан  километр  спор  вкус  признак  промышленность  американец  лоб  заключение  восток  исключение  ключ  постановление  слой  бок  июль  перевод  секретарь  кусок  слух  польза  звонок  обстановка  чиновник  соглашение  деталь  русский  тишина  зарплата  билет  подарок  тюрьма  ящик  конкурс  книжка  изучение  просьба  царь  публика  смех  сообщение  угроза  беда  блок  достижение  назначение  реклама  портрет  масло  стакан  урок  часы  крик  творчество  телевизор  инструмент  концепция  лейтенант  экран  дно  реальность  канал  мясо  знакомый  щека  конфликт  переговоры  запись  вагон  площадка  последствие  сотрудничество  зеркало  тон  академия  палата  потребность  ноябрь  увеличение  дурак  поездка  обед  потеря  февраль  мероприятие  парк  принятие  устройство  вещество  категория  сезон  гостиница  издание  объединение  темнота  человечество  колесо  опасность  разрешение  воздействие  коллектив  камера  запас  следствие  длина  крыло  округ  фон  кандидат  родственник  давление  присутствие  взаимодействие  доска  партнер  двигатель  шум  достоинство  грех  нож  полет  страсть  испытание  истина  оплата  разница  водитель  пакет  снижение  формула  живот  капитал  мост  новость  эффект  вход  губернатор  доклад  смена  убийство  эксперт  автобус  платье  кадр  тетя  общение  психология  лев  порог  проверка  процедура  рабочий  ремонт  обращение  обучение  ожидание  памятник  корень  наблюдение  буква  доказательство  признание  постель  штаб  владелец  компьютер  инженер  старуха  лодка  ракета  серия  шутка  вершина  выпуск  кулак  лед  торговля  нефть  молодежь  цифра  корпус  недостаток  сапог  сущность  талант  эффективность  кофе  полоса  основное  рассмотрение  сбор  штат  следователь  жилье  мешок  описание  куст  отказ  замок  редактор  дворец  забота  пиво  диван  столик  эксперимент  печать  кольцо  пистолет  воспитание  начальство  профессия  ворота  добро  дружба  покой  риск  окончание  дым  брак  величина  записка  инициатива  совесть  активность  кость  спорт  кредит  господь  майор  конференция  потолок  библиотека  помощник  конструкция  отдых  ручка  металл  молоко  прокурор  транспорт  поэзия  соединение  краска  расстояние  мечта  село  еда  зло  подразделение  сюжет  рубеж  сигнал  атмосфера  крест  вес  взрыв  контакт  сигарета  восторг  золото  почва  премия  король  подъезд  шанс  автомат  заказ  мальчишка  очки  миг  штука  чтение  поселок  свидетель  ставка  сумка  удивление  хвост  песок  поворот  возвращение  мгновение  статус  озеро  строй  параметр  сказка  тенденция  вина  дыхание  версия  масштаб  монастырь  хозяйка  дочка  танец  эксплуатация  коммунист  пенсия  приятель  объяснение  набор  производитель  пыль  философия  мощность  обязательство  уход  горло  кризис  указание  плата  яблоко  препарат  действительность  москвич  остаток  изображение  сделка  сочинение  покупатель  танк  затрата  строка  единица";

std::string strTest;

void Fillwords()
{
    std::string s;
    for (long long i = 0; i < w1000.size(); ++i)
    {
        if (w1000[i] == ' ' || i==w1000.size()-1)
        {
            if (!s.empty())
                words.push_back(s);
            s = "";
        }
        if (w1000[i] != ' ')
            s += w1000[i];
    }
}

//начальные 3 слова
void FullstrTest(int size)
{
    if (size != 10)
    {
        strTest = "";
        srand(time(0));
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
        strTest += ' ';
        strTest += words[rand() % size];
    }
    else
    {
        strTest = "";
        srand(time(0));
        strTest += strTest = "";
        srand(time(0));
        strTest += suggestions[rand() % suggestions.size()];
        strTest += ' ';
        strTest += suggestions[rand() % suggestions.size()];
        strTest += ' ';
        strTest += suggestions[rand() % suggestions.size()];
        strTest += ' ';
        strTest += suggestions[rand() % suggestions.size()];
    }
}